tests/jmeter/results/dashboard/statistics.json
{
  "POST /api/listings/json" : {
    "transaction" : "POST /api/listings/json",
    "sampleCount" : 20,
    "errorCount" : 20,
    "errorPct" : 100.0,
    "meanResTime" : 4.099999999999999,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 31.0,
    "pct1ResTime" : 16.500000000000032,
    "pct2ResTime" : 30.34999999999999,
    "pct3ResTime" : 31.0,
    "throughput" : 0.02103305976333601,
    "receivedKBytesPerSec" : 0.007106873709095957,
    "sentKBytesPerSec" : 0.009764762315908145
  },
  "POST /api/admin/listings/approve" : {
    "transaction" : "POST /api/admin/listings/approve",
    "sampleCount" : 20,
    "errorCount" : 20,
    "errorPct" : 100.0,
    "meanResTime" : 0.8499999999999999,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 2.0,
    "pct1ResTime" : 1.9000000000000021,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 2.0,
    "throughput" : 0.021033435801221412,
    "receivedKBytesPerSec" : 0.0025572878488789707,
    "sentKBytesPerSec" : 0.007977916469916402
  },
  "GET /api/listings" : {
    "transaction" : "GET /api/listings",
    "sampleCount" : 20,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 582.05,
    "medianResTime" : 575.0,
    "minResTime" : 514.0,
    "maxResTime" : 783.0,
    "pct1ResTime" : 654.7,
    "pct2ResTime" : 776.6499999999999,
    "pct3ResTime" : 783.0,
    "throughput" : 0.021019531348529054,
    "receivedKBytesPerSec" : 0.05367780710586277,
    "sentKBytesPerSec" : 0.0069257713642516625
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 80,
    "errorCount" : 50,
    "errorPct" : 62.5,
    "meanResTime" : 265.4875,
    "medianResTime" : 145.5,
    "minResTime" : 0.0,
    "maxResTime" : 1993.0,
    "pct1ResTime" : 615.8,
    "pct2ResTime" : 655.35,
    "pct3ResTime" : 1993.0,
    "throughput" : 0.08404579655454257,
    "receivedKBytesPerSec" : 0.07178672400778685,
    "sentKBytesPerSec" : 0.030489172143651076
  },
  "POST /api/auth/login" : {
    "transaction" : "POST /api/auth/login",
    "sampleCount" : 20,
    "errorCount" : 10,
    "errorPct" : 50.0,
    "meanResTime" : 474.95000000000005,
    "medianResTime" : 323.0,
    "minResTime" : 260.0,
    "maxResTime" : 1993.0,
    "pct1ResTime" : 1716.600000000003,
    "pct2ResTime" : 1986.4499999999998,
    "pct3ResTime" : 1993.0,
    "throughput" : 0.021023442189213083,
    "receivedKBytesPerSec" : 0.00848020780884225,
    "sentKBytesPerSec" : 0.005845091788348598
  }
}